<a href="https://colab.research.google.com/github/divyansh1195/Halliburton-Landmark-Learning/blob/master/%20Oil%20and%20Gas%20Dataset%20Wrangling%20using%20Python%20/Data_Transformation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#### In this notebook, I have performed Data Transformation on Oil and Gas dataset (Source:Halliburton Landmark Learning). The notebook implementation has been done based on tutorials provided in the Landmark Learning course, "Data Science using R."

#### I had completed the course, "Data Science using R" from Landmark Learning and then tried to implement the data transformation steps on my own in Python.

In [1]:
import pandas as pd
#read excel file
data=pd.read_excel('Production_data_wells.xlsx')
print(data.shape)
data.head()

(37312, 11)

  state  prod_year  ...  conden_prod_BBL  gas_wells_dayson
0    AK       2009  ...               83              5256
1    AK       2009  ...              256              2735
2    AK       2009  ...              217              2433
3    AK       2009  ...              549              2555
4    AK       2009  ...             1907              1854

[5 rows x 11 columns]

In [2]:
data.columns

Index(['state', 'prod_year', 'rate_class', 'num_oil_wells', 'oil_prod_BBL',
       'ADgas_prod_MCF', 'oil_wells_dayson', 'num_gas_wells', 'NAgas_prod_MCF',
       'conden_prod_BBL', 'gas_wells_dayson'],
      dtype='object')

In [3]:
## Extract subset of data from 2004 and state Ak? Write the data into a new dataframe
prod_data_2004=data[(data['state'] == 'AK') & (data['prod_year'] == 2004)]
print(prod_data_2004.shape)
prod_data_2004.head()

(22, 11)

    state  prod_year  ...  conden_prod_BBL  gas_wells_dayson
110    AK       2004  ...               56              3991
111    AK       2004  ...              137               732
112    AK       2004  ...              357              1127
113    AK       2004  ...              893              1098
114    AK       2004  ...              459               610

[5 rows x 11 columns]

In [4]:
## Arrange the dataframe wrt oil produced in barrels, 'oil_prod_BBL'
oil_prod=data.copy()
oil_prod.sort_values(['oil_prod_BBL'], axis=0, 
                 ascending=True, inplace=True) 
print(oil_prod.shape)
oil_prod.head()

(37312, 11)

      state  prod_year  ...  conden_prod_BBL  gas_wells_dayson
18655    MS       1988  ...                0                 0
19975    MT       1993  ...                0                 0
19974    MT       1993  ...                0                 0
19973    MT       1993  ...                0                 0
19972    MT       1993  ...                0                 0

[5 rows x 11 columns]

In [5]:
## find highest producer of oil in 2004
oil_prod_2004=data[(data['prod_year'] == 2004)]
oil_prod_2004.sort_values(['oil_prod_BBL'], axis=0, 
                 ascending=False, inplace=True)
print(oil_prod_2004.shape)
oil_prod_2004.head()

(726, 11)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

      state  prod_year  ...  conden_prod_BBL  gas_wells_dayson
8446     FG       2004  ...         10772295              7994
8445     FG       2004  ...         10075123             21809
8447     FG       2004  ...          2777116              2074
31253    TX       2004  ...         30579133           2984519
8444     FG       2004  ...          9361211             45737

[5 rows x 11 columns]

In [6]:
## average oil produced from each well per observation
# this can be achieved by creating new variable 'avg_oil_prod_well_state' 
data['avg_oil_prod_well_state']=data['oil_prod_BBL']/data['num_oil_wells']
print(data.shape)
data.head()

(37312, 12)

  state  prod_year  ...  gas_wells_dayson  avg_oil_prod_well_state
0    AK       2009  ...              5256                66.100000
1    AK       2009  ...              2735               396.166667
2    AK       2009  ...              2433               721.428571
3    AK       2009  ...              2555              1478.500000
4    AK       2009  ...              1854              1990.250000

[5 rows x 12 columns]

In [7]:
## average oil produced from each well for 2004 arranged in descending order in terms of 'avg_oil_prod_well_state'
avg_oil_2004=data[(data['prod_year'] == 2004)]
avg_oil_2004.sort_values(['avg_oil_prod_well_state'], axis=0, 
                 ascending=False, inplace=True)
print(avg_oil_2004.shape)
avg_oil_2004.head()

(726, 12)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

     state  prod_year  ...  gas_wells_dayson  avg_oil_prod_well_state
8447    FG       2004  ...              2074             4.198454e+06
131     AK       2004  ...                 0             3.220321e+06
8446    FG       2004  ...              7994             2.341800e+06
130     AK       2004  ...             15494             2.040044e+06
8445    FG       2004  ...             21809             1.223835e+06

[5 rows x 12 columns]

In [8]:
## average gas produced from each well when rate_class=20
avg_gas_prod_rate_class_20=data[(data['rate_class'] == 20)]
avg_gas_prod_rate_class_20.sort_values(['ADgas_prod_MCF'], axis=0, 
                 ascending=False, inplace=True)
print(avg_gas_prod_rate_class_20.shape)
avg_gas_prod_rate_class_20.head()

(1696, 12)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

    state  prod_year  ...  gas_wells_dayson  avg_oil_prod_well_state
503    AK       1987  ...              6935             1.161584e+06
437    AK       1990  ...             13081             1.047482e+06
459    AK       1989  ...             14843             1.090424e+06
481    AK       1988  ...              7320             1.155034e+06
525    AK       1986  ...              6570             1.198565e+06

[5 rows x 12 columns]

In [9]:
## select only gas wells in TX state and arrange them in decreasing order of number of gas wells 
gas_well_tx=data[(data['state'] == 'TX')]
gas_well_tx.sort_values(['num_gas_wells'], axis=0, 
                 ascending=False, inplace=True)
print(gas_well_tx.shape)
gas_well_tx.head()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

(1672, 12)

      state  prod_year  ...  gas_wells_dayson  avg_oil_prod_well_state
31132    TX       2009  ...           5416264               947.216623
31154    TX       2008  ...           5319774               943.595690
31198    TX       2006  ...           5010726               942.780651
31176    TX       2007  ...           5020957               935.874850
31220    TX       2005  ...           4738333               950.014520

[5 rows x 12 columns]

In [10]:
## group the data by year and count number of records in each year
data['prod_year'].value_counts()#for 'prod_year' record count

1992    726
1998    726
2004    726
2003    726
1993    726
       ...
1926     44
1922     44
1921     44
1920     44
1919     22
Name: prod_year, Length: 91, dtype: int64

In [11]:
## for 'rate_class' record count
data['rate_class'].value_counts()

22    1696
21    1696
2     1696
3     1696
4     1696
5     1696
6     1696
7     1696
8     1696
9     1696
10    1696
11    1696
12    1696
13    1696
14    1696
15    1696
16    1696
17    1696
18    1696
19    1696
20    1696
1     1696
Name: rate_class, dtype: int64

In [12]:
## for state='TX', find mean and total oil produced
tx_mean_oil=data[(data['state'] == 'TX')]
print('For "TX" state, the mean oil produced is',tx_mean_oil['oil_prod_BBL'].mean())
print('For "TX" state, the total oil produced is ',tx_mean_oil['oil_prod_BBL'].sum())

For "TX" state, the mean oil produced is 23985925.775119618
For "TX" state, the total oil produced is  40104467896

In [13]:
## for state !='TX', find mean and total oil produced
mean_oil_ntx=data[(data['state'] != 'TX')]
print('For states other than "TX", the mean oil produced is ',mean_oil_ntx['oil_prod_BBL'].mean())
print('For states other than "TX", the total oil produced is ',mean_oil_ntx['oil_prod_BBL'].sum())

For states other than "TX", the mean oil produced is  1896835.2172278338
For states other than "TX", the total oil produced is  67603207142

In [14]:
## from prod_data in TX state, find max oil produced in 2005
prod_data_2005=data[(data['state'] == 'TX') & (data['prod_year'] == 2005)]
print('For "TX" state and year "2005", the max oil produced is ', prod_data_2005['oil_prod_BBL'].max())

For "TX" state and year "2005", the max oil produced is  47314766

In [15]:
## from prod_data when state is not TX, find max oil produced in 2005
prod_data_2005=data[(data['state'] != 'TX') & (data['prod_year'] == 2005)]
print('For state!= "TX" and year "2005", the max oil produced is ', prod_data_2005['oil_prod_BBL'].max())

For state!= "TX" and year "2005", the max oil produced is  100773472